In [1]:
import pandas as pd

In [2]:
#df = pd.read_csv("./My Project/AI/20191115/employee.csv")
df = pd.read_csv("employee.csv")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 474 entries, 0 to 473
Data columns (total 5 columns):
employeeID    474 non-null int64
gender        470 non-null object
edu           462 non-null float64
salary        458 non-null float64
month         468 non-null float64
dtypes: float64(3), int64(1), object(1)
memory usage: 18.6+ KB

In [4]:
df.describe()

       employeeID         edu         salary       month
count  474.000000  462.000000     458.000000  468.000000
mean   237.500000   13.491342   34503.220524   80.978632
std    136.976275    2.891181   17227.247525   10.044631
min      1.000000    8.000000   15750.000000   63.000000
25%    119.250000   12.000000   24000.000000   72.000000
50%    237.500000   12.000000   28875.000000   81.000000
75%    355.750000   15.000000   37612.500000   90.000000
max    474.000000   21.000000  135000.000000   98.000000

In [5]:
df.corr()

            employeeID       edu    salary     month
employeeID    1.000000 -0.057022 -0.101074 -0.998168
edu          -0.057022  1.000000  0.663120  0.056918
salary       -0.101074  0.663120  1.000000  0.088655
month        -0.998168  0.056918  0.088655  1.000000

In [7]:
groupd = df.groupby(df.gender).size()
df.groupby(df.gender).size()
df.gender.value_counts()

m    255
f    215
Name: gender, dtype: int64

In [21]:
df1 = df.salary.fillna(5000)

In [25]:
df1.describe()

count       474.000000
mean      33507.331224
std       17753.569242
min        5000.000000
25%       23550.000000
50%       28425.000000
75%       36000.000000
max      135000.000000
Name: salary, dtype: float64

In [32]:
#df.dropna(axis='rows',thresh >= 2)
df2 = df.dropna(axis='rows', thresh = 2)
df2 = df2.dropna(axis='rows', thresh = 3)
df2 = df2.dropna(axis='rows', thresh = 4)
df.dropna()

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 469 entries, 0 to 473
Data columns (total 5 columns):
employeeID    469 non-null int64
gender        467 non-null object
edu           458 non-null float64
salary        458 non-null float64
month         466 non-null float64
dtypes: float64(3), int64(1), object(1)
memory usage: 42.0+ KB